### PANDAS PROVIDE TWO DATA STRUCTURE FOR MANIPULATING

#### DIFFERENT WAYS OF CREATING DATAFRAME

#### FROM DICTIONARY

In [145]:
import numpy as np

data={"country":["india","uk","austria","us",np.nan],
      "GDP":[123,345,678,np.nan,2134],
     "populaion":["1.4B","250M","200M","300M","230M"]
     } 
data

{'country': ['india', 'uk', 'austria', 'us', nan],
 'GDP': [123, 345, 678, nan, 2134],
 'populaion': ['1.4B', '250M', '200M', '300M', '230M']}

In [146]:
import pandas as pd
import numpy as np
df=pd.DataFrame(data)
df

   country     GDP populaion
0    india   123.0      1.4B
1       uk   345.0      250M
2  austria   678.0      200M
3       us     NaN      300M
4      NaN  2134.0      230M

In [147]:
d={"Name":["piya","riya","asshi","meera"],"Age":['20','30','60','23'],\
 "Height":[120.3,152.4,155,162],"Gender":["f","f","m","f"]}  ## \ is used to break the lines
d

{'Name': ['piya', 'riya', 'asshi', 'meera'],
 'Age': ['20', '30', '60', '23'],
 'Height': [120.3, 152.4, 155, 162],
 'Gender': ['f', 'f', 'm', 'f']}

In [148]:
df1=pd.DataFrame(d)
df1

    Name Age  Height Gender
0   piya  20   120.3      f
1   riya  30   152.4      f
2  asshi  60   155.0      m
3  meera  23   162.0      f

In [151]:
df1.loc[0,"class"]=34
df1

    Name Age  Height Gender     0  class
0   piya  20   120.3      f  34.0   34.0
1   riya  30   152.4      f   NaN    NaN
2  asshi  60   155.0      m   NaN    NaN
3  meera  23   162.0      f   NaN    NaN

In [156]:
df1.drop(0,axis=1)

    Name Age  Height Gender  class
0   piya  20   120.3      f   34.0
1   riya  30   152.4      f    NaN
2  asshi  60   155.0      m    NaN
3  meera  23   162.0      f    NaN

### Checking tha column type (*imp*)

In [17]:
df1.dtypes

Name       object
Age        object
Height    float64
Gender     object
dtype: object

### Change tha one datatype into another type by (ASTYPE())

In [19]:
df1["Age"]=df1["Age"].astype(int)

In [14]:
df1

    name  age  height gender
0   piya   20   120.3      f
1   riya   30   152.4      f
2  asshi   60   155.0      m
3  meera   23   162.0      f

In [15]:
df1.dtypes

name       object
age         int32
height    float64
gender     object
dtype: object

In [16]:
df1["age"].dtype

dtype('int32')

### Find info()

In [20]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int32
 2   Height  4 non-null      float64
 3   Gender  4 non-null      object
dtypes: float64(1), int32(1), object(2)
memory usage: 240.0+ bytes

### Create tha dataframe from list

In [18]:
l=[1,2,3,4,5]
df=pd.DataFrame(l)
df

   0
0  1
1  2
2  3
3  4
4  5

In [19]:
type(df)

pandas.core.frame.DataFrame

In [20]:
l1=[[1,2,3,4],[4,5,6,7,8]]
df=pd.DataFrame(l1)
df

   0  1  2  3    4
0  1  2  3  4  NaN
1  4  5  6  7  8.0

In [22]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [23]:
df.columns                  ## only column name

Index(['country', 'GDP', 'populaion'], dtype='object')

In [24]:
l1=np.array([[1,2,3,4],[4,5,6,7]])
df=pd.DataFrame(l1,index=["a","b"],columns=["A","B","C","D"])
df

   A  B  C  D
a  1  2  3  4
b  4  5  6  7

In [24]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [25]:
df.index

Index(['a', 'b'], dtype='object')

### FETCH TOP 5 ROWS (DEALING WTH ROWS)

In [25]:
df={"country":["india","uk","austria","us","canada","pakistan"],
    "GDP":[123,123,678,2134,3456,232],
    "country_type":["developing","developed","developed",
                    "developed","developed","developing"]}  # from dictionary 
df=pd.DataFrame(df)
df

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

### Top five rows in dataframem

In [27]:
df.head()

   country   GDP country_type
0    india   123   developing
1       uk   123    developed
2  austria   678    developed
3       us  2134    developed
4   canada  3456    developed

### Bottom five rows

In [28]:
df.tail()

    country   GDP country_type
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

### loc()----(location) 
### iloc()----(indexlocation)

In [28]:
import pandas as pd
df1=pd.DataFrame(df)
df1

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

In [30]:
df1.loc[:4]           # it is inclue last element of given range

   country   GDP country_type
0    india   123   developing
1       uk   123    developed
2  austria   678    developed
3       us  2134    developed
4   canada  3456    developed

In [31]:
df1.loc[1:2]

   country  GDP country_type
1       uk  123    developed
2  austria  678    developed

## iloc() function

In [32]:
df1.iloc[3]

country                us
GDP                  2134
country_type    developed
Name: 3, dtype: object

In [33]:
df1.iloc[2:5]      # it is not inclue last element of given range

   country   GDP country_type
2  austria   678    developed
3       us  2134    developed
4   canada  3456    developed

In [36]:
df1.iloc[[1,4,5]]     #its give specific rows

    country   GDP country_type
1        uk   123    developed
4    canada  3456    developed
5  pakistan   232   developing

In [37]:
df1.iloc[:,2]

0    developing
1     developed
2     developed
3     developed
4     developed
5    developing
Name: country_type, dtype: object

In [38]:
df1.iloc[:,1:]

    GDP country_type
0   123   developing
1   123    developed
2   678    developed
3  2134    developed
4  3456    developed
5   232   developing

In [40]:
df1

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

In [46]:
df1.iloc[[2,1],[0,2]]

   country country_type
2  austria    developed
1       uk    developed

### loc() fetch tha valus  in form of string

In [47]:
df1

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

### making country as index.

In [48]:
df1.set_index(df1["country"],inplace=True)
df1

           country   GDP country_type
country
india        india   123   developing
uk              uk   123    developed
austria    austria   678    developed
us              us  2134    developed
canada      canada  3456    developed
pakistan  pakistan   232   developing

In [49]:
df1.loc[:,"country_type"]

country
india       developing
uk           developed
austria      developed
us           developed
canada       developed
pakistan    developing
Name: country_type, dtype: object

In [50]:
df1.index

Index(['india', 'uk', 'austria', 'us', 'canada', 'pakistan'], dtype='object', name='country')

In [51]:
df1.columns

Index(['country', 'GDP', 'country_type'], dtype='object')

In [52]:
df1.drop(columns=["country"],inplace=True)
df1

           GDP country_type
country
india      123   developing
uk         123    developed
austria    678    developed
us        2134    developed
canada    3456    developed
pakistan   232   developing

In [54]:
df1.loc["uk":"pakistan"]

           GDP country_type
country
uk         123    developed
austria    678    developed
us        2134    developed
canada    3456    developed
pakistan   232   developing

In [56]:
df1.loc[["uk","canada"]]

          GDP country_type
country
uk        123    developed
canada   3456    developed

In [59]:
df1.loc[:,["GDP"]]

           GDP
country
india      123
uk         123
austria    678
us        2134
canada    3456
pakistan   232

### RESET INDEX()

In [60]:
df1.reset_index(inplace=True)

In [61]:
df1

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

In [ ]:
a={}
n=int(input("enter number of element"))
column=input("enter number of columns")
for i in range(n):
    #column=input("enter number of columns")
    k=input("enter  key")
    v=int(input("enter value"))

    a.update({k:v})
print(a)

## Adding the rows..

## adding new rows to tha dataframe using append.its adds new rows at tha end.
### using append()-- add tha rows of one datafrmae to tha target dataframe at tha end.

In [1]:
import pandas as pd
d = pd.DataFrame([[7, 8], [9, 10]], columns = ['x','y'])  
d2 = pd.DataFrame([[11, 12]],columns = ['1','2'])

In [2]:
d

   x   y
0  7   8
1  9  10

In [3]:
d2

    1   2
0  11  12

In [4]:
data=d2.append(d)   #different names of columns
data

C:\Users\ad\AppData\Local\Temp\ipykernel_10684\317634688.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  data=d2.append(d)   #different names of columns

      1     2    x     y
0  11.0  12.0  NaN   NaN
0   NaN   NaN  7.0   8.0
1   NaN   NaN  9.0  10.0

In [5]:
data=d.append(d2)
data

C:\Users\ad\AppData\Local\Temp\ipykernel_10684\15323378.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  data=d.append(d2)

     x     y     1     2
0  7.0   8.0   NaN   NaN
1  9.0  10.0   NaN   NaN
0  NaN   NaN  11.0  12.0

In [6]:
## once tha dataframe

In [8]:
data=data.append(d2,ignore_index=True)
data

C:\Users\ad\AppData\Local\Temp\ipykernel_10684\1418760976.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  data=data.append(d2,ignore_index=True)

     x     y     1     2
0  7.0   8.0   NaN   NaN
1  9.0  10.0   NaN   NaN
2  NaN   NaN  11.0  12.0
3  NaN   NaN  11.0  12.0

In [9]:
import pandas as pd
d = pd.DataFrame([[7, 8], [9, 10]], columns = ['x','y'])  
d2 = pd.DataFrame([[11, 12]],columns = ['x','y'])

In [10]:
d

   x   y
0  7   8
1  9  10

In [11]:
d2

    x   y
0  11  12

In [12]:
d1=d2.append(d)
d1
data=d.append(d2,ignore_index=True)
data

C:\Users\ad\AppData\Local\Temp\ipykernel_10684\715781142.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  d1=d2.append(d)
C:\Users\ad\AppData\Local\Temp\ipykernel_10684\715781142.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  data=d.append(d2,ignore_index=True)

    x   y
0   7   8
1   9  10
2  11  12

In [13]:
d1 = {'Name':['Martha', 'Tim', 'Rob', 'Georgia'],
        'Maths':[87, 91, 97, 95],
        'Science':[83, 99, 84, 76]
       }
df1=pd.DataFrame(d1)
df1

      Name  Maths  Science
0   Martha     87       83
1      Tim     91       99
2      Rob     97       84
3  Georgia     95       76

In [14]:
df1.iloc[2]=["sona",39,90]
df1

      Name  Maths  Science
0   Martha     87       83
1      Tim     91       99
2     sona     39       90
3  Georgia     95       76

In [16]:
df1.iloc[1:3]=["heena",45,34],["poo",31,98]  # to update tha multiple rows
df1

      Name  Maths  Science
0   Martha     87       83
1    heena     45       34
2      poo     31       98
3  Georgia     95       76

In [19]:
df1['Name'].iloc[0]="ravi"
df1

C:\Users\ad\AppData\Local\Temp\ipykernel_10684\996554479.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['Name'].iloc[0]="ravi"

      Name  Maths  Science
0     ravi     87       83
1    heena     45       34
2      poo     31       98
3  Georgia     95       76

## loc()

In [20]:
df1.set_index("Name",inplace=True)  ##3 set_index is used to convert any column into index
df1

         Maths  Science
Name
ravi        87       83
heena       45       34
poo         31       98
Georgia     95       76

In [21]:
df1.loc["jai"]=[23,56]       ## by using loc we can add data in tha  dataframe
df1

         Maths  Science
Name
ravi        87       83
heena       45       34
poo         31       98
Georgia     95       76
jai         23       56

In [22]:
df1.reset_index(inplace=True)  ##3 set_index is used to convert any column into index
df1

      Name  Maths  Science
0     ravi     87       83
1    heena     45       34
2      poo     31       98
3  Georgia     95       76
4      jai     23       56

In [25]:
#df1.iloc[5]=["rhia",56,46]  ### w cant expand data by help of iloc we can just update by usimg iloc
#df1

## Rows deletion

In [26]:
df1

      Name  Maths  Science
0     ravi     87       83
1    heena     45       34
2      poo     31       98
3  Georgia     95       76
4      jai     23       56

In [27]:
df1.drop(1)   ### to delete tha spcific rows

      Name  Maths  Science
0     ravi     87       83
2      poo     31       98
3  Georgia     95       76
4      jai     23       56

In [28]:
df1

      Name  Maths  Science
0     ravi     87       83
1    heena     45       34
2      poo     31       98
3  Georgia     95       76
4      jai     23       56

In [31]:
df2=df1.drop(3)
df2

    Name  Maths  Science
0   ravi     87       83
1  heena     45       34
2    poo     31       98
4    jai     23       56

In [32]:
df1 = pd.DataFrame([[4, 5], [6, 7]], columns = ['x','y'])  
df1

   x  y
0  4  5
1  6  7

In [33]:
df1.drop(0)

   x  y
1  6  7

In [46]:
df=pd.DataFrame({"state":["delhi","gujrat","up","goa","mp","sikkim"],
                 "population":[90,80,70,10,34,30],
                 "state_region":["north","west","north","south","south","east"]})
df

    state  population state_region
0   delhi          90        north
1  gujrat          80         west
2      up          70        north
3     goa          10        south
4      mp          34        south
5  sikkim          30         east

## In tha form of slicing

In [47]:
df.drop(index=df.index[0:6:2])         # deleting every alternate rows

    state  population state_region
1  gujrat          80         west
3     goa          10        south
5  sikkim          30         east

In [48]:
df.drop(index=df.index[0:6:2],inplace=True)   # deleting every alternate rows in df permanantly

In [59]:
df=pd.DataFrame({"state":["delhi","gujrat","up","goa","mp","sikkim"],
                 "population":[90,80,70,10,34,30],
                 "state_region":["north","west","north","south","south","east"]})
df

    state  population state_region
0   delhi          90        north
1  gujrat          80         west
2      up          70        north
3     goa          10        south
4      mp          34        south
5  sikkim          30         east

In [60]:
df[["state","state_region"]]

    state state_region
0   delhi        north
1  gujrat         west
2      up        north
3     goa        south
4      mp        south
5  sikkim         east

## Column renaming

In [61]:
df.rename(columns={"state":"Town"},inplace=True)
df

     Town  population state_region
0   delhi          90        north
1  gujrat          80         west
2      up          70        north
3     goa          10        south
4      mp          34        south
5  sikkim          30         east

## Column reording

In [64]:
df=df[["population","Town","state_region"]]
df

   population    Town state_region
0          90   delhi        north
1          80  gujrat         west
2          70      up        north
3          10     goa        south
4          34      mp        south
5          30  sikkim         east

In [65]:
df.column=["p"]
df

C:\Users\ad\AppData\Local\Temp\ipykernel_10684\4127347108.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df.column=["p"]

   population    Town state_region
0          90   delhi        north
1          80  gujrat         west
2          70      up        north
3          10     goa        south
4          34      mp        south
5          30  sikkim         east

In [73]:
df.dtypes

population      float64
Town             object
state_region     object
dtype: object

In [74]:
obj_type=df.select_dtypes(include="object")
obj_type

     Town state_region
0   delhi        north
1  gujrat         west
2      up        north
3     goa        south
4      mp        south
5  sikkim         east

In [75]:
obj_type.columns

Index(['Town', 'state_region'], dtype='object')

In [76]:
obj_type=df.select_dtypes(include="int")
obj_type

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]

In [77]:
df.dtypes

population      float64
Town             object
state_region     object
dtype: object

In [78]:
df1=df["population"]=df["population"].astype("float")
df1.dtypes

dtype('float64')

In [79]:
df1

0    90.0
1    80.0
2    70.0
3    10.0
4    34.0
5    30.0
Name: population, dtype: float64

In [80]:
numeric=["float","int"]
df.select_dtypes(include=numeric)

   population
0        90.0
1        80.0
2        70.0
3        10.0
4        34.0
5        30.0

## Creating series from array

In [84]:
import numpy as np
data=np.array(["a","b","c","d"])
data=pd.Series(data)
data

0    a
1    b
2    c
3    d
dtype: object

## Creating series fron dict (keys are my index)

In [86]:
d={"a":10,"v":40,"b":90}
ser=pd.Series(d)    #(keys treated as index)
ser

a    10
v    40
b    90
dtype: int64

In [87]:
ser1=pd.Series(d,index=["x","y","z"])  ### index missmatch (where nan valye creates)
ser1

x   NaN
y   NaN
z   NaN
dtype: float64

In [88]:
k=ser1.reset_index() #  (inplace=True)
k

  index   0
0     x NaN
1     y NaN
2     z NaN

In [89]:
k.drop(columns=[0],inplace=True)
k

  index
0     x
1     y
2     z

In [94]:
date=pd.date_range("1/1/2000",periods=12)  ## date range is a pandas function to generate dates 
date

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08',
               '2000-01-09', '2000-01-10', '2000-01-11', '2000-01-12'],
              dtype='datetime64[ns]', freq='D')

In [95]:
x=pd.DataFrame(date,columns=["dates"])
x

        dates
0  2000-01-01
1  2000-01-02
2  2000-01-03
3  2000-01-04
4  2000-01-05
5  2000-01-06
6  2000-01-07
7  2000-01-08
8  2000-01-09
9  2000-01-10
10 2000-01-11
11 2000-01-12

In [96]:
a=np.arange(12)
a

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11])

In [97]:
x["new_col"]=pd.Series(a)
x

        dates  new_col
0  2000-01-01        0
1  2000-01-02        1
2  2000-01-03        2
3  2000-01-04        3
4  2000-01-05        4
5  2000-01-06        5
6  2000-01-07        6
7  2000-01-08        7
8  2000-01-09        8
9  2000-01-10        9
10 2000-01-11       10
11 2000-01-12       11

In [103]:
## making index as dates
x.set_index(x["dates"],inplace=True)
x

                dates  new_col
dates
2000-01-01 2000-01-01        0
2000-01-02 2000-01-02        1
2000-01-03 2000-01-03        2
2000-01-04 2000-01-04        3
2000-01-05 2000-01-05        4
2000-01-06 2000-01-06        5
2000-01-07 2000-01-07        6
2000-01-08 2000-01-08        7
2000-01-09 2000-01-09        8
2000-01-10 2000-01-10        9
2000-01-11 2000-01-11       10
2000-01-12 2000-01-12       11

In [105]:
x

                dates  new_col
dates
2000-01-01 2000-01-01        0
2000-01-02 2000-01-02        1
2000-01-03 2000-01-03        2
2000-01-04 2000-01-04        3
2000-01-05 2000-01-05        4
2000-01-06 2000-01-06        5
2000-01-07 2000-01-07        6
2000-01-08 2000-01-08        7
2000-01-09 2000-01-09        8
2000-01-10 2000-01-10        9
2000-01-11 2000-01-11       10
2000-01-12 2000-01-12       11

In [107]:
x.drop(columns=["dates"],inplace=True)

In [108]:
x

            new_col
dates
2000-01-01        0
2000-01-02        1
2000-01-03        2
2000-01-04        3
2000-01-05        4
2000-01-06        5
2000-01-07        6
2000-01-08        7
2000-01-09        8
2000-01-10        9
2000-01-11       10
2000-01-12       11

In [135]:
### dictionary questions
s=input("enter tha string")
d={}
key=0
for i in s:
        d[key]=i
        key+=1
print(d)

enter tha stringHEMA
{0: 'H', 1: 'E', 2: 'M', 3: 'A'}

In [136]:
import pandas as pd
df=pd.DataFrame(d,index=[1,2,3,4])

In [137]:
df

   0  1  2  3
1  H  E  M  A
2  H  E  M  A
3  H  E  M  A
4  H  E  M  A

In [139]:
df.loc[0,0]=45
df

    0    1    2    3
1   H    E    M    A
2   H    E    M    A
3   H    E    M    A
4   H    E    M    A
0  45  NaN  NaN  NaN

In [140]:
### dictionary questions
s=input("enter tha string")
d={}
for i in s:
        key=i
        asc=ord(key)
        d[asc]=i
print(d)

enter tha string
{}

In [141]:
pd.DataFrame(d,index=[0,1,2,3,4,5])

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]

In [124]:
r=np.random.rand(34,3)
r

array([[0.27858837, 0.36786096, 0.18036061],
       [0.85435745, 0.73737653, 0.6640256 ],
       [0.14813403, 0.86584031, 0.27222555],
       [0.83981176, 0.91608548, 0.94415891],
       [0.54809519, 0.3973146 , 0.38974078],
       [0.1295599 , 0.74326462, 0.04270552],
       [0.89054991, 0.38715678, 0.39857281],
       [0.76029651, 0.72914732, 0.18291294],
       [0.59218001, 0.11809996, 0.49432017],
       [0.41347614, 0.01332577, 0.43196714],
       [0.94836617, 0.74349554, 0.6564933 ],
       [0.97510976, 0.63862382, 0.79524395],
       [0.25766231, 0.92967392, 0.11451653],
       [0.63937801, 0.05631302, 0.85300307],
       [0.17173713, 0.07900954, 0.03577762],
       [0.14642745, 0.99366058, 0.53657156],
       [0.13736918, 0.81475374, 0.09639311],
       [0.00366102, 0.94769509, 0.62155122],
       [0.67026459, 0.49590959, 0.09783352],
       [0.3424983 , 0.01391663, 0.62961128],
       [0.19569878, 0.91004281, 0.11426245],
       [0.20087864, 0.92423947, 0.0976928 ],
       [0.08474351, 0.78998965, 0.45329812],
       [0.71756078, 0.84207746, 0.2417025 ],
       [0.8767808 , 0.71647655, 0.12173647],
       [0.34579481, 0.1118052 , 0.28366745],
       [0.54324206, 0.93106675, 0.48540539],
       [0.39609902, 0.10911511, 0.99487459],
       [0.15776677, 0.01581235, 0.66206561],
       [0.9156895 , 0.58269069, 0.4020394 ],
       [0.85003148, 0.59472993, 0.24519127],
       [0.903152  , 0.22836124, 0.1243257 ],
       [0.72864277, 0.70597628, 0.85289014],
       [0.34519648, 0.75612062, 0.77404519]])

In [158]:
import keyword

In [162]:
keyword.kwlist

['False',
 'None',
 'True',
 '__peg_parser__',
 'and',
 'as',
 'assert',
 'async',
 'await',
 'break',
 'class',
 'continue',
 'def',
 'del',
 'elif',
 'else',
 'except',
 'finally',
 'for',
 'from',
 'global',
 'if',
 'import',
 'in',
 'is',
 'lambda',
 'nonlocal',
 'not',
 'or',
 'pass',
 'raise',
 'return',
 'try',
 'while',
 'with',
 'yield']

In [169]:
n=int(input("enter tha num of n"))
for i in range(n):
    print("k"*n)

enter tha num of n6
kkkkkk
kkkkkk
kkkkkk
kkkkkk
kkkkkk
kkkkkk

In [181]:
n=int(input("enter tha num "))
for i in range(1,n+1):
    for k in range(1,n+1):
        print(i,end=" ")
    print(i)

enter tha num 5
1 1 1 1 1 1
2 2 2 2 2 2
3 3 3 3 3 3
4 4 4 4 4 4
5 5 5 5 5 5

In [184]:
n=int(input("enter tha num rows "))
for i in range(1,n+1):
    for k in range(1,n+1):
        print(k,end=" ")
    print()

enter tha num rows 5
1 2 3 4 5
1 2 3 4 5
1 2 3 4 5
1 2 3 4 5
1 2 3 4 5

In [188]:
n=int(input("enter tha num "))
for i in range(1,n+1):
    for k in range(1,n+1):
        print(n+1-i,end=" ")
    print()

enter tha num 6
6 6 6 6 6 6
5 5 5 5 5 5
4 4 4 4 4 4
3 3 3 3 3 3
2 2 2 2 2 2
1 1 1 1 1 1

In [190]:
n=int(input("enter tha num of n"))
for i in range(n):
    print("k"*i)

enter tha num of n6

k
kk
kkk
kkkk
kkkkk

In [192]:
n=int(input("enter tha num "))
for i in range(1,n+1):
    for k in range(1,n+2-i):
        print("*",end=" ")
    print()

enter tha num 5
* * * * *
* * * *
* * *
* *
*